In [1]:
import pandas as pd

In [2]:
list={"first":["Corey","Jane","John"],"last":["Schafer","Doe","Doe"],"email":["CoreyMSchafer@gmail.com","JaneDoe@gmail.com","JohnDoe@gmail.com"]}

In [3]:
d=pd.DataFrame(list)

In [4]:
df = pd.read_csv('data/survey_results_public1.csv')

In [5]:
schema_df = pd.read_csv('data/survey_results_schema.csv')

In [6]:
d.drop(columns=['first','last'])

                     email
0  CoreyMSchafer@gmail.com
1        JaneDoe@gmail.com
2        JohnDoe@gmail.com

#### CREATING A NEW COLUMN

In [8]:
d['full_name']=d['first'] +' '+d['last']
d

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe

In [9]:
d['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

### dropping columns

In [10]:
d.drop(columns=['first','last'])

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@gmail.com       Jane Doe
2        JohnDoe@gmail.com       John Doe

In [11]:
d['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

#### add row

In [13]:
d.append({'first':'Troy'},ignore_index=True)

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe
3   Troy      NaN                      NaN            NaN

In [14]:
list2={'first':['Tony','Steve'],'last':['Stark','Rogers'],'email':['Ironman@avenge.com','Cap@avanege.com']}
d2=pd.DataFrame(list2)

In [16]:
d=d.append(d2,ignore_index=True)
d

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe
3   Tony    Stark       Ironman@avenge.com            NaN
4  Steve   Rogers          Cap@avanege.com            NaN
5   Tony    Stark       Ironman@avenge.com            NaN
6  Steve   Rogers          Cap@avanege.com            NaN

#### dropping rows

In [17]:
d.drop(index=4)

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe
3   Tony    Stark       Ironman@avenge.com            NaN
5   Tony    Stark       Ironman@avenge.com            NaN
6  Steve   Rogers          Cap@avanege.com            NaN

In [18]:
filt=d['last']=='Doe'
d.drop(index=d[filt].index)

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
3   Tony    Stark       Ironman@avenge.com            NaN
4  Steve   Rogers          Cap@avanege.com            NaN
5   Tony    Stark       Ironman@avenge.com            NaN
6  Steve   Rogers          Cap@avanege.com            NaN